InformationRegisters/СтатистикаОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаОбращений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПериодВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КоличествоОбъектов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ТестированиеВебСервера/Ext/Module.bsl
Процедура ВыполнитьОбращениеКВебСерверу(ПараметрыТестирования) Экспорт
	
	Если ПараметрыТестирования.ОбъектТестирования = 0 Тогда
		ВыполнитьОбращениеКВебСерверуЧерезHTTP(ПараметрыТестирования);
		ВыполнитьОбращениеКВебСерверуЧерезOData(ПараметрыТестирования);
	ИначеЕсли ПараметрыТестирования.ОбъектТестирования = 1 Тогда
		ВыполнитьОбращениеКВебСерверуЧерезHTTP(ПараметрыТестирования);
	ИначеЕсли ПараметрыТестирования.ОбъектТестирования = 2 Тогда
		ВыполнитьОбращениеКВебСерверуЧерезOData(ПараметрыТестирования);
	КонецЕсли;
			
КонецПроцедуры

Процедура ВыполнитьОбращениеКВебСерверуЧерезHTTP(ПараметрыТестирования)
	
	СтруктураURI = СтруктураURI(ПараметрыТестирования.АдресHTTP); 
	HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт, СтруктураURI.Логин);
	
	Для СчетчикОбращений = 1 По ПараметрыТестирования.КоличествоОбращений Цикл
		Для Каждого КоличествоОбъектов ИЗ ПараметрыТестирования.МассивКоличествоОбъектов Цикл
						
			HTTPЗапрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере + "?$top=" + СтрЗаменить(Строка(КоличествоОбъектов), Символы.НПП, ""));
			
			ВремяДо = ТекущаяУниверсальнаяДатаВМиллисекундах();
	        Результат =  HTTPСоединение.Получить(HTTPЗапрос);
	        ВремяПосле = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
			СоздатьЗаписьСтатистикиОбращений(ТекущаяДата(), "HTTP", ПараметрыТестирования.НомерПотока, КоличествоОбъектов, ВремяПосле - ВремяДо);
			
		КонецЦикла;
	КонецЦикла;
			
КонецПроцедуры

Процедура ВыполнитьОбращениеКВебСерверуЧерезOData(ПараметрыТестирования)
	
	СтруктураURI = СтруктураURI(ПараметрыТестирования.АдресOData); 
	HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт, СтруктураURI.Логин);
	
	Для СчетчикОбращений = 1 По ПараметрыТестирования.КоличествоОбращений Цикл
		Для Каждого КоличествоОбъектов ИЗ ПараметрыТестирования.МассивКоличествоОбъектов Цикл
						
			HTTPЗапрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере + "?$top=" + СтрЗаменить(Строка(КоличествоОбъектов), Символы.НПП, ""));
			
			ВремяДо = ТекущаяУниверсальнаяДатаВМиллисекундах();
	        Результат =  HTTPСоединение.Получить(HTTPЗапрос);
	        ВремяПосле = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
			СоздатьЗаписьСтатистикиОбращений(ТекущаяДата(), "OData", ПараметрыТестирования.НомерПотока, КоличествоОбъектов, ВремяПосле - ВремяДо);
			
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

Процедура СоздатьЗаписьСтатистикиОбращений(ПериодВыполнения, Провайдер, НомерПотока, КоличествоОбъектов, ВремяВыполнения)
	
	МЗ = РегистрыСведений.СтатистикаОбращений.СоздатьМенеджерЗаписи();
	МЗ.ПериодВыполнения = ПериодВыполнения;
	МЗ.Провайдер = Провайдер;
	МЗ.Задание = "Задание" + Строка(НомерПотока);
	МЗ.КоличествоОбъектов = КоличествоОбъектов;
	МЗ.ВремяВыполнения = ВремяВыполнения;
	
	МЗ.Записать(Истина);
		
КонецПроцедуры
 
Функция СтруктураURI(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// вообще говоря, не надо учитывать символы после #
	// но для упрощения примера игнорируем такие случаи
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;

	// строка соединения и путь на сервере
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
		
	// информация пользователя и имя сервера
	//СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	//Позиция = Найти(СтрокаСоединения, "@");
	//Если Позиция > 0 Тогда
	//	СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
	//	ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	//КонецЕсли;
	
	// логин и пароль
	Логин = "Administrator";
	Пароль = "";
	//Позиция = Найти(СтрокаАвторизации, ":");
	//Если Позиция > 0 Тогда
	//	Логин = Лев(СтрокаАвторизации, Позиция - 1);
	//	Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	//КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции
